class YandexHomePageFAQ:
    ANS_1 = "Сутки — 400 рублей. Оплата курьеру — наличными или картой."
    ANS_2 = "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."
    ANS_3 = "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."
    ANSs_4 = "Только начиная с завтрашнего дня. Но скоро станем расторопнее."
    ANS_5 = "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."
    ANS_6 = "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."
    ANS_7 = "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."
    ANS_8 = "Да, обязательно. Всем самокатов! И Москве, и Московской области."


class YandexOrderPageData:
    data_sets = {
        'data_set1': {
            'first_name': 'Иван',
            'last_name': 'Васильевич',
            'address': 'Спиридоновская улица',
            'metro_name': 'Пушкинская',
            'telepthone_number': '79258890123',
            'date': '10.08.2024',
            'rental_period': 0,
            'color': [0],
            'comment_for_courier': 'Спрячусь за деревом',
            'description': 'Корректные данные'
        },
        'data_set2':
            {'first_name': 'Петя',
             'last_name': 'Петров',
             'address': 'Петровская улица',
             'metro_name': 'Чертановская',
             'telepthone_number': '79996427702',
             'date': '10.08.2024',
             'rental_period': 1,
             'color': [0, 1],
             'comment_for_courier': 'Где-то рядом',
             'description': 'Корректные данные'
             },
    }